docs/dev.org


* Main UI

** DONE Create main style

** Create 

** TODO create UI states for navigation bar and menu

*** TODO Show login and signup if not logged in
Show login and signup links  if not loggedin 

*** TODO show default universal feed if not logged in
    

* User registration

** DONE Create cassandra user model functions

** DONE Create user model interfaces

** DONE Create UI for registration page

** DONE Integrate mail notification for registration

** DONE Show registration success UI
   DEADLINE: <2016-04-07 Thu>

** DONE Activate user via clicking mail link
   DEADLINE: <2016-04-07 Thu>


** DONE Fix key slash bug in activation link
   Example : Somteimes key looks like this "GkWreW2iq/GKa+HMF18b0g== " which has a slash in it. This will produce 404 error since slash is recognized as a link route
   Possible Solution: Try sending this key as a query parameter
   Start: <2016-04-07 Thu 19:43>
   End: <2016-04-07 Thu 19:58>

* User login

** DONE Create UI for login page

** TODO create user login cassandra functions
   DEADLINE: <2016-04-07 Thu>
   
** TODO create logout function
   DEADLINE: <2016-04-07 Thu>
   

** TODO create user status function
   
** TODO create user logged in status for menus

* Boxes

** TODO Create box

*** Fields

**** Box name
**** Box description

