docs/dev.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>dev</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="dev"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-04-07T16:32+0530"/>
<meta name="author" content="devasia"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">dev</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Main UI</a>
<ul>
<li><a href="#sec-1-1">1.1 Create main style</a></li>
<li><a href="#sec-1-2">1.2 Create</a></li>
<li><a href="#sec-1-3">1.3 create UI states for navigation bar and menu</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Show login and signup if not logged in</a></li>
<li><a href="#sec-1-3-2">1.3.2 show default universal feed if not logged in</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 User registration</a>
<ul>
<li><a href="#sec-2-1">2.1 Create cassandra user model functions</a></li>
<li><a href="#sec-2-2">2.2 Create user model interfaces</a></li>
<li><a href="#sec-2-3">2.3 Create UI for registration page</a></li>
<li><a href="#sec-2-4">2.4 Integrate mail notification for registration</a></li>
<li><a href="#sec-2-5">2.5 Show registration success UI</a></li>
<li><a href="#sec-2-6">2.6 Activate user via clicking mail link</a></li>
<li><a href="#sec-2-7">2.7 Fix key slash bug in activation link</a></li>
</ul>
</li>
<li><a href="#sec-3">3 User login</a>
<ul>
<li><a href="#sec-3-1">3.1 Create UI for login page</a></li>
<li><a href="#sec-3-2">3.2 create user login cassandra functions</a></li>
<li><a href="#sec-3-3">3.3 create logout function</a></li>
</ul>
</li>
<li><a href="#sec-4">4 User boxes</a>
<ul>
<li><a href="#sec-4-1">4.1 Create box</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 Fields</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Main UI</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Create main style</h3>
<div class="outline-text-3" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Create</h3>
<div class="outline-text-3" id="text-1-2">


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> create UI states for navigation bar and menu</h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> <span class="todo TODO">TODO</span> Show login and signup if not logged in</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>Show login and signup links  if not loggedin 
</p>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> <span class="todo TODO">TODO</span> show default universal feed if not logged in</h4>
<div class="outline-text-4" id="text-1-3-2">



</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User registration</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Create cassandra user model functions</h3>
<div class="outline-text-3" id="text-2-1">


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Create user model interfaces</h3>
<div class="outline-text-3" id="text-2-2">


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Create UI for registration page</h3>
<div class="outline-text-3" id="text-2-3">


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <span class="done DONE">DONE</span> Integrate mail notification for registration</h3>
<div class="outline-text-3" id="text-2-4">


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <span class="done DONE">DONE</span> Show registration success UI</h3>
<div class="outline-text-3" id="text-2-5">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2016-04-07 Thu</span></span><br/>
</p>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> <span class="done DONE">DONE</span> Activate user via clicking mail link</h3>
<div class="outline-text-3" id="text-2-6">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2016-04-07 Thu</span></span><br/>
</p>

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> Fix key slash bug in activation link</h3>
<div class="outline-text-3" id="text-2-7">

<p>   Example : Somteimes key looks like this "GkWreW2iq/GKa+HMF18b0g== " which has a slash in it. This will produce 404 error since slash is recognized as a link route
   Possible Solution: Try sending this key as a query parameter
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> User login</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> Create UI for login page</h3>
<div class="outline-text-3" id="text-3-1">


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> create user login cassandra functions</h3>
<div class="outline-text-3" id="text-3-2">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2016-04-07 Thu</span></span><br/>
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> create logout function</h3>
<div class="outline-text-3" id="text-3-3">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2016-04-07 Thu</span></span><br/>
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> User boxes</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Create box</h3>
<div class="outline-text-3" id="text-4-1">



</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Fields</h4>
<div class="outline-text-4" id="text-4-1-1">


<ul>
<li id="sec-4-1-1-1">Box name<br/>

</li>
</ul>
<ul>
<li id="sec-4-1-1-2">Box description<br/>

</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-04-07T16:32+0530</p>
<p class="author">Author: devasia</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
